//
//  DataManager.swift
//  Dictionary
//
//  Created by chenzhiwei on 2024/12/25.
//  Copyright © 2024年 chenzhiwei. All rights reserved.
//
import UIKit

class DataManager{
    static let shared = DataManager();
    private init(){};
    
    var selectedWorkType:String?;
    var selectedWork:String?;
    var selectedPage:Int?;
    var selectedAuthor:String?;
    
    var inputSentence:[Character]?;
    var authorForSearch:String? = "全部";
    var workTypeForSearch:String? = "全部";
    var responseWordList:[String]? = [];
    var wordIdx:Int? = 0;
    
    var showFavorite = false;
    
    var accountList = [
        ["admin","admin"]
    ]
    
    var isLoginIn = false;
    
    var currentUsername:String? = "admin";
    
    var historyList:[String] = [];
    
    var favoriteList:[String] = [];
    
    let showWorkList = ["楷书-多宝塔碑","行书-兰亭序","草书-急就章"];
    
    let showAuthorList = ["颜真卿","王羲之","柳公权"];
    
    let profileList = ["我的收藏","历史记录","软件说明","为我们打分","当前版本"];
    
    let workList = [
        ["多宝塔碑","雁塔圣教序","真草千字文","王居士塔砖铭","圭峰禅师本"],
        ["兰亭序","祭侄文稿","张猛龙碑","中秋帖","洛神赋"],
        ["千字文","出师颂","十七帖","上阳台帖","急就章"]
    ]
    
    let PageNumDict:[String:Int] = [
        "多宝塔碑": 8,
        "雁塔圣教序": 6,
        "真草千字文": 1,
        "王居士塔砖铭": 1,
        "圭峰禅师本": 1,
        "兰亭序": 4,
        "祭侄文稿": 1,
        "张猛龙碑": 1,
        "中秋帖": 1,
        "洛神赋":1,
        "千字文": 1,
        "出师颂": 1,
        "十七帖": 1,
        "上阳台帖": 1,
        "急就章": 5
    ]
    

    let workListDictByAuthor: [String:[String]] = [
        "全部":["兰亭序","祭侄文稿","金刚经"],
        "王羲之":["兰亭序"],
        "颜真卿":["祭侄文稿"],
        "柳公权":["金刚经"]
    ]
    
    let workTypeList = ["楷书","行书","草书","全部"];
    
    let wordListDict: [[String]:[String]] = [
    ["王羲之","行书","兰亭序"]:["永","和","九","年","岁","在","癸","丑","暮","春","之","初","会","于","会","稽","山","阴","之","兰","亭",],
    ["颜真卿","楷书","多宝塔碑"]:["大","唐","西","京","千","福","寺","多","宝","佛","塔","感","应","碑","文"],
    ["柳公权","楷书","金刚经"]:["金","刚","般","若","波","罗","蜜","经","如","是","我","闻","一","时"],
    ["李白","草书","上阳台帖"]:["山","高","千","万","老","壮","可","十","八","日","上","阳","台"],
    ["王羲之","楷书","停云馆法帖"]:["听"]
    ]
    
    let workYearDict:[String:String] = [
        "兰亭序":"东晋",
        "多宝塔碑":"唐朝",
        "金刚经":"北魏",
        "上阳台帖":"南朝",
        "停云馆法帖":"南朝"
    ]
    
    
    let authorMsgList = [
        "颜真卿":["颜真卿（709年—785年8月23日），字清臣，小名羡门子，别号应方，京兆府长安县（今陕西省西安市）人，祖籍琅邪郡临沂县（今山东省临沂市），唐朝政治家、书法家。其楷书与欧阳询、柳公权、赵孟𫖯并称“楷书四大家“。",
                     "颜真卿出生在家学传统的家庭，先辈中有不少古文字学家、书法家。颜真卿少时家贫缺纸笔，用笔醮黄土水在墙上练字。颜真卿书法初学褚遂良，后学张旭，50岁以后才形成刚劲、雄浑的显著风格。其书品与人品颇为贴合。宋人推崇颜真卿的人品，好学颜体。在苏轼、黄庭坚看来，颜真卿继承了王羲之的变法精神，是唐朝书法的改革家。颜体一般指颜真卿所创的楷书字体，其端庄雄伟，气势开张，与柳公权并称“颜柳”，有“颜筋柳骨”之誉。苏轼曾说：“诗至于杜子美，文至于韩退之，画至于吴道子，书至于颜鲁公，而古今之变，天下之能事尽矣。”可靠墨迹有《祭侄文稿》。后人编有《颜鲁公文集》。"],
        "王羲之":["王羲之（303年—361年），字逸少，原籍琅邪郡临沂（今属山东），后迁居山阴（今浙江绍兴），官拜右军将军，人称王右军。为王导之侄，是东晋时期的书法家，人称书圣，与书法家锺繇合称为“锺王”。其书法师承卫夫人（卫夫人则师承锺繇）[1]，又因其家族属于正一道世家，故亦曾受录为道士，颇受正一符箓影响。",
                     "王羲之的书法实践，变当时流行的章草、八分为今草、行书、楷书，是书体转换时期平地而起的高峰。其书法尺牍散见于唐朝的精摹本《十七帖》、《快雪时晴帖》、现藏于日本的《丧乱帖》、《孔侍中帖》等名品。王羲之的书法真迹皆已失传，其作品《兰亭集序》等帖，均为后人临摹。王羲之出身名门望族。祖籍琅邪，琅邪王姓原本出自姬姓，其家史可以追溯到周灵王太子王子乔的后人，王羲之十七世祖王元为避秦朝时乱乃由咸阳迁至琅邪。王羲之的曾祖父王览是二十四孝里的“卧冰求鲤”王祥同父异母的弟弟。王祥于晋武帝时拜太保，王览亦官至光禄大夫。匈奴击破晋朝之后，社会动荡，人心惶惶，晋元帝在江北和江南招揽人才，大批北方士族“渡江”南迁。313年，王羲之年仅十岁，随着琅邪王氏家族迁居金陵，王导为晋元帝丞相，王家子弟位居皇室朝廷的大部分重要权职。查考《晋书》，王氏列传占据很大的比例。"],
        "柳公权":["柳公权（778年—865年），字诚悬，京兆府华原县（今陕西省铜川市耀州区）人，祖籍河东郡解县（今山西省运城市临猗县），出自河东柳氏东眷，唐朝大书法家。他担任侍书（朝廷书法教师）数十年，因书见重，历仕数朝，位至太子少傅，封河东郡公，追赠太子太师。他工于书法，尤其精通碑版楷书，开创“柳体”这一中国书法发展史上最后的楷书书体，成为唐朝楷书艺术最后的完善者。代表作有《玄秘塔碑》、《神策军碑》、《〈送梨帖〉跋》等。",
                "柳公权生于唐大历十三年（778年），出身于官宦世家，父亲柳子温官至丹州刺史、追赠尚书右仆射，兄长柳公绰官至兵部尚书、追赠太子太保。宪宗元和元年（806年），柳公权登进士第。初仕秘书省校书郎，久不升迁。十四年（819年），被夏绥银宥节度使李听辟为掌书记。次年穆宗即位，柳公权入京奏事，被早已欣赏其书法的穆宗留下，即日拜右拾遗，担任翰林侍书学士（朝廷书法教师）。穆宗、敬宗、文宗三朝，长期担任侍书。因不受重用，乃托兄长柳公绰向宰相李宗闵求助，于大和五年（831年）出放翰林院。大和八年（834年），柳公权奉诏再次担任侍书，是为人生最大转折点。文宗数次试图消灭宦官势力，但均以失败告终，遂政治理想破灭，日渐愁苦，而常召柳公权入宫中侍讲诗文、书法。柳公权深得文宗器重，恩宠日加，不断升迁封爵。宣宗大中二年（848年）晋爵河东郡公，八年（854年）拜太子少傅。书艺精湛，地位显赫，因此作品贵重当世，求其书碑版者甚多。懿宗咸通六年（865年）去世，享年八十八岁，追赠太子太师。"]
    ]
    
}
